Blog/Screen.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Screen of programmer</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Screen of programmer"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-17T15:39+0800"/>
<meta name="author" content="Richard Wong"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Screen of programmer</h1>


<p>
程序员的下一个屏幕要求：屏幕的宽度对程序员而言最好选取（80+5）*2+2，即
172字符每行。
假设使用mono字体并且字符宽度为t。
一般工业级代码标准一般每行不大于79t。这样加上侧边栏的一个字符。加上行
数5t。加上分割栏2t。不需要行数的同志同理就少10t，只需要162t了。假设使
用1080p的屏幕，（1920x1080）
那么假设编程界面全屏，不包含系统所生成得边界框。每字符占据宽为：
1920/172=11.16.
一般而言1080p得24寸屏，使用11-12号字是比较合适的字号。
点距和字号关系大概就是：。。。。。。未完待续
ref：
</p><ol>
<li><a href="http://blog.itman.cc/archives/common-specifications-lcd-display-size-pitch-resolution/">http://blog.itman.cc/archives/common-specifications-lcd-display-size-pitch-resolution/</a>
</li>
<li>
</li>
</ol>

</div>

<div id="postamble">
<p class="date">Date: 2012-08-17T15:39+0800</p>
<p class="author">Author: Richard Wong</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.8.11 with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
